#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.random[2]: Refreshing state... [id=991123]
random_string.random[0]: Refreshing state... [id=920455]
random_string.random[1]: Refreshing state... [id=735905]
data.google_organization.vytrac_me: Reading...
data.google_billing_account.billing: Reading...
google_project.homelab_dev: Refreshing state... [id=projects/homelab-dev-735905]
google_project.homelab_prod: Refreshing state... [id=projects/homelab-prod-991123]
data.google_organization.vytrac_me: Read complete after 0s [id=organizations/222061260236]
data.google_billing_account.billing: Read complete after 1s [id=012AF6-DBCAAF-ADA2BC]
google_project.admin: Refreshing state... [id=projects/admin-920455]
google_project_service.admin_services["cloudkms.googleapis.com"]: Refreshing state... [id=325329770668/cloudkms.googleapis.com]
google_project_service.admin_services["secretmanager.googleapis.com"]: Refreshing state... [id=325329770668/secretmanager.googleapis.com]
google_service_account.tf_sa: Refreshing state... [id=projects/admin-920455/serviceAccounts/gitops-iac@admin-920455.iam.gserviceaccount.com]
google_project_service.admin_services["storage.googleapis.com"]: Refreshing state... [id=325329770668/storage.googleapis.com]
data.google_secret_manager_secret_version.cloudflare_api_token: Reading...
google_project_service.admin_services["cloudbilling.googleapis.com"]: Refreshing state... [id=325329770668/cloudbilling.googleapis.com]
google_project_service.admin_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=325329770668/cloudresourcemanager.googleapis.com]
google_project_service.admin_services["iam.googleapis.com"]: Refreshing state... [id=325329770668/iam.googleapis.com]
google_project_service.admin_services["serviceusage.googleapis.com"]: Refreshing state... [id=325329770668/serviceusage.googleapis.com]
google_kms_key_ring.keyring: Refreshing state... [id=projects/admin-920455/locations/us-central1/keyRings/homelab-keyring]
data.google_secret_manager_secret_version.gcloud_domain_verifications: Reading...
data.google_secret_manager_secret_version.cloudflare_api_token: Read complete after 0s [id=projects/325329770668/secrets/cloudflare-api-token/versions/1]
google_project_iam_binding.tf_sa_binding["roles/storage.admin"]: Refreshing state... [id=325329770668/roles/storage.admin]
google_organization_iam_binding.tf_sa_binding["roles/billing.viewer"]: Refreshing state... [id=222061260236/roles/billing.viewer]
data.google_secret_manager_secret_version.gcloud_domain_verifications: Read complete after 0s [id=projects/325329770668/secrets/gcloud-domain-verifications/versions/1]
google_organization_iam_binding.tf_sa_binding["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=222061260236/roles/iam.serviceAccountAdmin]
google_organization_iam_binding.tf_sa_binding["roles/iam.serviceAccountKeyAdmin"]: Refreshing state... [id=222061260236/roles/iam.serviceAccountKeyAdmin]
google_organization_iam_binding.tf_sa_binding["roles/resourcemanager.organizationAdmin"]: Refreshing state... [id=222061260236/roles/resourcemanager.organizationAdmin]
google_organization_iam_binding.tf_sa_binding["roles/resourcemanager.projectCreator"]: Refreshing state... [id=222061260236/roles/resourcemanager.projectCreator]
google_organization_iam_binding.tf_sa_binding["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=222061260236/roles/resourcemanager.projectIamAdmin]
google_organization_iam_binding.tf_sa_binding["roles/serviceusage.serviceUsageAdmin"]: Refreshing state... [id=222061260236/roles/serviceusage.serviceUsageAdmin]
google_service_account_key.tf_sa_key: Refreshing state... [id=projects/admin-920455/serviceAccounts/gitops-iac@admin-920455.iam.gserviceaccount.com/keys/25d95a9f9a8373f6213c1daada502f1c1f0f57fb]
google_project_iam_binding.tf_sa_binding["roles/cloudkms.admin"]: Refreshing state... [id=325329770668/roles/cloudkms.admin]
google_project_iam_binding.tf_sa_binding["roles/secretmanager.secretAccessor"]: Refreshing state... [id=325329770668/roles/secretmanager.secretAccessor]
google_project_iam_binding.tf_sa_binding["roles/secretmanager.viewer"]: Refreshing state... [id=325329770668/roles/secretmanager.viewer]
google_kms_crypto_key.secrets_key: Refreshing state... [id=projects/admin-920455/locations/us-central1/keyRings/homelab-keyring/cryptoKeys/secrets-key]
google_kms_crypto_key.tfstate_key: Refreshing state... [id=projects/admin-920455/locations/us-central1/keyRings/homelab-keyring/cryptoKeys/tfstate-key]
cloudflare_email_routing_address.email: Refreshing state... [id=232419e353df4c66962536ac35c6b31c]
data.cloudflare_zone.zone: Reading...
google_kms_crypto_key_iam_binding.tfstate_sa_binding: Refreshing state... [id=projects/admin-920455/locations/us-central1/keyRings/homelab-keyring/cryptoKeys/tfstate-key/roles/cloudkms.cryptoKeyEncrypterDecrypter]
google_storage_bucket.gcs_bucket: Refreshing state... [id=tfstate.vytrac.me]
google_kms_crypto_key_iam_binding.secrets_sa_binding: Refreshing state... [id=projects/admin-920455/locations/us-central1/keyRings/homelab-keyring/cryptoKeys/secrets-key/roles/cloudkms.cryptoKeyEncrypterDecrypter]
data.cloudflare_zone.zone: Read complete after 1s [id=a53af84a2f59d2dcf19713b7a04c616c]
cloudflare_record.spf: Refreshing state... [id=14751139d6392c51051de019a32fdee6]
cloudflare_page_rule.www: Refreshing state... [id=499701397f31774c253cb6cd37d9e615]
cloudflare_record.mail["1"]: Refreshing state... [id=8cf323c167727bb8d64853dc313f42e1]
cloudflare_record.tilde: Refreshing state... [id=64ff826f2a3e121810813d1fdb8bce2c]
cloudflare_record.root: Refreshing state... [id=b96b0a0dcd2527470dcb9a7460f6e9e3]
cloudflare_record.gcloud_verifications[0]: Refreshing state... [id=b5930144dccfca4af1a6f23136a43193]
cloudflare_email_routing_rule.email: Refreshing state... [id=13666d9008a944c98b0b306dd09418b5]
cloudflare_record.dmarc: Refreshing state... [id=6aabe3e9dc6e384483381754ea508057]
cloudflare_record.mail["2"]: Refreshing state... [id=c0366e4f58c493a1b29158ba19dadbff]
cloudflare_record.gcloud_verifications[1]: Refreshing state... [id=8161e4e15a36bc464f8bd68cead33d13]
cloudflare_record.www: Refreshing state... [id=a73a91c2e993a2e7cc2917a6d9111078]
cloudflare_record.mail["0"]: Refreshing state... [id=e6502757e33c4330484806c39466dc0c]
cloudflare_record.notes: Refreshing state... [id=2d9ab04912f7aa67c8d979e3fd40601d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_project.homelab will be created
  + resource "google_project" "homelab" {
      + auto_create_network = true
      + billing_account     = "012AF6-DBCAAF-ADA2BC"
      + id                  = (known after apply)
      + name                = "Homelab"
      + number              = (known after apply)
      + org_id              = "222061260236"
      + project_id          = "homelab-735905"
      + skip_delete         = (known after apply)
    }

  # google_project.homelab_dev will be destroyed
  # (because google_project.homelab_dev is not in configuration)
  - resource "google_project" "homelab_dev" {
      - auto_create_network = true -> null
      - billing_account     = "012AF6-DBCAAF-ADA2BC" -> null
      - id                  = "projects/homelab-dev-735905" -> null
      - labels              = {} -> null
      - name                = "Homelab Dev" -> null
      - number              = "715279525401" -> null
      - org_id              = "222061260236" -> null
      - project_id          = "homelab-dev-735905" -> null
    }

  # google_project.homelab_prod will be destroyed
  # (because google_project.homelab_prod is not in configuration)
  - resource "google_project" "homelab_prod" {
      - auto_create_network = true -> null
      - billing_account     = "012AF6-DBCAAF-ADA2BC" -> null
      - id                  = "projects/homelab-prod-991123" -> null
      - labels              = {} -> null
      - name                = "Homelab Prod" -> null
      - number              = "1053141747654" -> null
      - org_id              = "222061260236" -> null
      - project_id          = "homelab-prod-991123" -> null
    }

  # google_project_iam_binding.tf_sa_binding["roles/cloudkms.admin"] must be replaced
-/+ resource "google_project_iam_binding" "tf_sa_binding" {
      ~ etag    = "BwYEbT+fuMI=" -> (known after apply)
      ~ id      = "325329770668/roles/cloudkms.admin" -> (known after apply)
      ~ project = "325329770668" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_iam_binding.tf_sa_binding["roles/secretmanager.secretAccessor"] must be replaced
-/+ resource "google_project_iam_binding" "tf_sa_binding" {
      ~ etag    = "BwYEbT+fuMI=" -> (known after apply)
      ~ id      = "325329770668/roles/secretmanager.secretAccessor" -> (known after apply)
      ~ project = "325329770668" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_iam_binding.tf_sa_binding["roles/secretmanager.viewer"] must be replaced
-/+ resource "google_project_iam_binding" "tf_sa_binding" {
      ~ etag    = "BwYEbT+fuMI=" -> (known after apply)
      ~ id      = "325329770668/roles/secretmanager.viewer" -> (known after apply)
      ~ project = "325329770668" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_iam_binding.tf_sa_binding["roles/storage.admin"] must be replaced
-/+ resource "google_project_iam_binding" "tf_sa_binding" {
      ~ etag    = "BwYEbT+fuMI=" -> (known after apply)
      ~ id      = "325329770668/roles/storage.admin" -> (known after apply)
      ~ project = "325329770668" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.homelab_services["cloudbilling.googleapis.com"] will be created
  + resource "google_project_service" "homelab_services" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudbilling.googleapis.com"
    }

  # google_project_service.homelab_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "homelab_services" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.homelab_services["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "homelab_services" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "serviceusage.googleapis.com"
    }

  # random_string.random[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "random_string" "random" {
      - id          = "991123" -> null
      - length      = 6 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 6 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "991123" -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 8 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

```

terraform

```

</details>

*Pusher: @celia-vytrac, Action: `pull_request`, Working Directory: `iac`, Workflow: `Terraform CI/CD`*